In [2]:
import pandas as pd
from sqlalchemy import create_engine
import numpy as np
import psycopg2

In [3]:
# Pass the connection string to a variable of conn_url
conn_url = 'postgresql://postgres:123@localhost/project_final_2'

# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

In [5]:
createcmd = """

create table movie_length(
    length_id varchar(30), 
    runtime int, 
    range varchar(30),
    PRIMARY KEY (length_id)
);

Create table title (
    title_id varchar(50),
    title_name varchar(200),
    Primary key (title_id)
);

Create table type (
    type_id varchar(30),
    type_name varchar(50),
    Primary key (type_id)
);

Create table genres (
    genre_id varchar(30),
    genre_name varchar(50),
    Primary key (genre_id)
);

Create table Country (
    country_id varchar(30),
    country varchar(50),
    Primary key (country_id)
);

Create table Age_certification(
    certification_id varchar(30),
    certification_name varchar(50),
    Primary key (Certification_id)
);

Create table role(
    role_id varchar(30),
    role varchar(50),
    Primary key (role_id)
);

Create table IMDB (
    title_id varchar(30),
    imdb_id varchar(30),
    Imdb_votes numeric(10,1),
    imdb_score numeric(10,1),
    Primary key (imdb_id),
    Foreign key (title_id) references title
);

Create table person (
    person_id varchar(200),
    name varchar(200),
    Primary key (person_id)
);

Create table character_detail(
    character_detail_id varchar(200),
    person_id varchar(200),
    character varchar(500),
    role_id varchar(30),
    voice varchar(10), 
    singing_voice varchar(10), 
    credited varchar(10),
    credit_only varchar(10),
    Primary key (character_detail_id),
    Foreign key (Person_id) references person,
    Foreign key (role_id) references role
);

Create table actor_detail (
    title_id varchar(30),
    person_id varchar(200),
    character_detail_id varchar(200),
    Foreign key (character_detail_id) references character_detail,
    Foreign key (title_id) references title,
    Foreign key (person_id) references person
);

Create table Director_detail (
    title_id varchar(30),
    person_id varchar(200),
    Foreign key (title_id) references title,
    Foreign key (person_id) references person
);


Create table TMDB(
    title_id varchar(30),
    tmdb_popularity numeric(7,3),
    tmdb_score numeric(10,1),
    Foreign key (title_id) references title
);

Create table Company(
    company_id varchar(30),
    company_name varchar(50),
    Primary key (company_id)
);

Create table title_genres(
    title_id varchar(30),
    genre_id varchar(30),
    Foreign key (title_id) references title,
    Foreign key (genre_id) references genres
);

create table description(
    description_id varchar(30),
    title_id varchar(30), 
    type_id varchar(30), 
    description TEXT, 
    release_year int, 
    length_id varchar(30), 
    seasons int, 
    company_id varchar(30),
    country_id varchar(30),
    age_certification_id varchar(30),
    PRIMARY KEY (description_id),
    Foreign key (title_id) references title,
    Foreign key (type_id) references type,
    Foreign key (length_id) references movie_length,
    Foreign key (company_id) references company,
    Foreign key (country_id) references country,
    Foreign key (age_certification_id) references Age_certification
);

"""

In [6]:
connection.execute(createcmd)

drop_all = """
drop table movie_length cascade;
drop table title cascade;
drop table type cascade;
drop table genres cascade;
drop table country cascade;
drop table age_certification cascade;
drop table imdb cascade;
drop table tmdb cascade;
drop table role cascade;
drop table company cascade;
drop table character_detail cascade;
drop table title_genres cascade;
drop table description cascade;
drop table actor cascade;
drop table act cascade;
drop table director cascade;
drop table direct cascade;
"""

connection.execute(drop_all)

### Load & format original dataset

In [7]:
# read titles dataset
disney_t = pd.read_csv('titles_disney.csv')
hbo_t = pd.read_csv('titles_hbo.csv')
amazon_t = pd.read_csv('titles_amazon.csv')

In [8]:
# read credits dataset
disney_c = pd.read_csv('credits_disney.csv')
hbo_c = pd.read_csv('credits_hbo.csv')
amazon_c = pd.read_csv('credits_amazon.csv')

In [9]:
disney_t.head()

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"['animation', 'family', 'music', 'fantasy']",['US'],NaN,tt0032455,7.7,94681.0,57.751,7.4
1,tm67803,Snow White and the Seven Dwarfs,MOVIE,"A beautiful girl, Snow White, takes refuge in ...",1937,G,83,"['fantasy', 'family', 'romance', 'animation', ...",['US'],NaN,tt0029583,7.6,195321.0,107.137,7.1
2,tm82546,Pinocchio,MOVIE,Lonely toymaker Geppetto has his wishes answer...,1940,G,88,"['animation', 'comedy', 'family', 'fantasy']",['US'],NaN,tt0032910,7.5,141937.0,71.160,7.1
3,tm79357,Bambi,MOVIE,Bambi's tale unfolds from season to season as ...,1942,G,70,"['animation', 'drama', 'family']",['US'],NaN,tt0034492,7.3,140406.0,68.136,7.0
4,tm62671,Treasure Island,MOVIE,Enchanted by the idea of locating treasure bur...,1950,PG,96,"['family', 'action']","['GB', 'US']",NaN,tt0043067,6.9,8229.0,10.698,6.5

In [10]:
# add company column and run-time range column(0-60 -> short; 60-90 -> medium; 90+ -> long)
disney_t['company'] = 'Disney'
amazon_t['company'] = 'Amazon'
hbo_t['company'] = 'HBO'

In [11]:
disney = disney_t.merge(disney_c, on='id', how='outer')
amazon = amazon_t.merge(amazon_c, on='id', how='outer')
hbo = hbo_t.merge(hbo_c, on='id', how='outer')

In [12]:
concat1 = pd.concat([disney, amazon], axis=0, ignore_index=True)
data = pd.concat([concat1, hbo], axis=0, ignore_index=True)

In [13]:
data.info()
# data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 218434 entries, 0 to 218433
Data columns (total 20 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   id                    218434 non-null  object
 1   title                 218434 non-null  object
 2   type                  218434 non-null  object
 3   description           218219 non-null  object
 4   release_year          218434 non-null  int64
 5   age_certification     132133 non-null  object
 6   runtime               218434 non-null  int64
 7   genres                218434 non-null  object
 8   production_countries  218434 non-null  object
 9   seasons               15294 non-null   float64
 10  imdb_id               206829 non-null  object
 11  imdb_score            205590 non-null  float64
 12  imdb_votes            205423 non-null  float64
 13  tmdb_popularity       217836 non-null  float64
 14  tmdb_score            206114 non-null  float64
 15  company               218434 non-null  object
 16  person_id             217152 non-null  float64
 17  name                  217152 non-null  object
 18  character             194697 non-null  object
 19  role                  217152 non-null  object
dtypes: float64(6), int64(2), object(12)
memory usage: 33.3+ MB

In [14]:
# assign runtime range column
conditions = [
    (data['runtime'] <= 60),
    (data['runtime'] >= 60) & (data['runtime'] < 90),
    (data['runtime'] >= 90)
]

values = ['short', 'medium', 'long']

data['range'] = np.select(conditions, values)

In [15]:
data.head()

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,...,imdb_score,imdb_votes,tmdb_popularity,tmdb_score,company,person_id,name,character,role,range
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"['animation', 'family', 'music', 'fantasy']",['US'],NaN,...,7.7,94681.0,57.751,7.4,Disney,23433.0,Deems Taylor,Narrator - Narrative Introductions,ACTOR,long
1,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"['animation', 'family', 'music', 'fantasy']",['US'],NaN,...,7.7,94681.0,57.751,7.4,Disney,5910.0,Walt Disney,Mickey Mouse (segment 'The Sorcerer's Apprenti...,ACTOR,long
2,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"['animation', 'family', 'music', 'fantasy']",['US'],NaN,...,7.7,94681.0,57.751,7.4,Disney,23436.0,Julietta Novis,Soloist (segment 'Ave Maria') (singing voice),ACTOR,long
3,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"['animation', 'family', 'music', 'fantasy']",['US'],NaN,...,7.7,94681.0,57.751,7.4,Disney,23434.0,Leopold Stokowski,Himself - Conductor of The Philadelphia Orchestra,ACTOR,long
4,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"['animation', 'family', 'music', 'fantasy']",['US'],NaN,...,7.7,94681.0,57.751,7.4,Disney,23441.0,Paul Satterfield,NaN,DIRECTOR,long

### Insert into runtime _movie_length_ table

In [16]:
# Drop duplicates records
movie_length = data[['runtime','range']]

# Add incrementing numbers to the created column 'laptop'
movie_length.insert(0, 'length_id', range(1, 1 + len(movie_length)))

In [17]:
# Load to "movie_length" table in sql
movie_length.to_sql(name='movie_length', con=engine, if_exists='append', index=False)

434

In [18]:
data['length_id'] = movie_length.length_id

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 218434 entries, 0 to 218433
Data columns (total 22 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   id                    218434 non-null  object
 1   title                 218434 non-null  object
 2   type                  218434 non-null  object
 3   description           218219 non-null  object
 4   release_year          218434 non-null  int64
 5   age_certification     132133 non-null  object
 6   runtime               218434 non-null  int64
 7   genres                218434 non-null  object
 8   production_countries  218434 non-null  object
 9   seasons               15294 non-null   float64
 10  imdb_id               206829 non-null  object
 11  imdb_score            205590 non-null  float64
 12  imdb_votes            205423 non-null  float64
 13  tmdb_popularity       217836 non-null  float64
 14  tmdb_score            206114 non-null  float64
 15  company               218434 non-null  object
 16  person_id             217152 non-null  float64
 17  name                  217152 non-null  object
 18  character             194697 non-null  object
 19  role                  217152 non-null  object
 20  range                 218434 non-null  object
 21  length_id             218434 non-null  int64
dtypes: float64(6), int64(3), object(13)
memory usage: 36.7+ MB

### Insert into _title_ table

- the pandas column name has to match the sql column name
- title_name is varchar(50), which is too short for some of the title name

In [20]:
# Drop duplicates records
title = data[['id','title']].drop_duplicates()

title = title.rename(columns={"id": "title_id", "title": "title_name"})

# Add incrementing numbers to the created column 'laptop'
# movie_length.insert(0, 'length_id', range(1, 1 + len(movie_length)))

In [21]:
# Load to "title" table in sql
title.to_sql(name='title', con=engine, if_exists='append', index=False)

660

### Insert into _type_ table

In [22]:
# Drop duplicates records
type = data[['type']].drop_duplicates()

type = type.rename(columns={"type": "type_name"})

# Add incrementing numbers to the created column 'laptop'
type.insert(0, 'type_id', range(1, 1 + len(type))

In [23]:
# Load to "type" table in sql
type.to_sql(name='type', con=engine, if_exists='append', index=False)

2

In [24]:
# data = data.drop(columns=['type_id'])

In [25]:
data['type_id'] = np.where(data['type'] == 'MOVIE', 1, 2)
data.head()

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,...,tmdb_popularity,tmdb_score,company,person_id,name,character,role,range,length_id,type_id
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"['animation', 'family', 'music', 'fantasy']",['US'],NaN,...,57.751,7.4,Disney,23433.0,Deems Taylor,Narrator - Narrative Introductions,ACTOR,long,1,1
1,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"['animation', 'family', 'music', 'fantasy']",['US'],NaN,...,57.751,7.4,Disney,5910.0,Walt Disney,Mickey Mouse (segment 'The Sorcerer's Apprenti...,ACTOR,long,2,1
2,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"['animation', 'family', 'music', 'fantasy']",['US'],NaN,...,57.751,7.4,Disney,23436.0,Julietta Novis,Soloist (segment 'Ave Maria') (singing voice),ACTOR,long,3,1
3,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"['animation', 'family', 'music', 'fantasy']",['US'],NaN,...,57.751,7.4,Disney,23434.0,Leopold Stokowski,Himself - Conductor of The Philadelphia Orchestra,ACTOR,long,4,1
4,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"['animation', 'family', 'music', 'fantasy']",['US'],NaN,...,57.751,7.4,Disney,23441.0,Paul Satterfield,NaN,DIRECTOR,long,5,1

### Insert into _genre_ table

In [26]:
import re

data['genres']=data['genres'].str.strip('[]')
data['genres']=data['genres'].str.strip('\'')

temp_genres_df = data.genres.str.split(',').apply(pd.Series, 1).stack()
temp_genres_df.index = temp_genres_df.index.droplevel(-1)
temp_genres_df.name = 'movie_genres'
data = data.join(temp_genres_df)
# temp_genres_df=data.set_index('title')['genres'].str.split(',\s*', expand=True).stack().reset_index(name='genres').drop('level_1',1)

# genres_df = pd.DataFrame(temp_genres_df.genres.unique(), columns=['genres'])
# genres_df.genres = genres_df.genres.str.strip("'")
# genres_df = genres_df.drop_duplicates()

# genres_df.insert(0, 'genre_id', range(1, 1 + len(genres_df)))
# genres_df = genres_df.reset_index().drop(['index'], axis=1)
# genres_df = genres_df[genres_df.genre_id != 17]
# genres_df.insert(0, 'genre_id_2', range(1, 1 + len(genres_df)))
# genres_df = genres_df[['genre_id_2', 'genres']]
# genres_df = genres_df.rename(columns={'genre_id_2' : 'genre_id'})

# genres_df

In [27]:
# remove extra quotation marks in the string
for i in range(len(data.movie_genres)):
    data.movie_genres.values[i] = re.sub("'", "", data.movie_genres.values[i])

data.movie_genres

# insert id into genres table
genres_df= pd.DataFrame(data.movie_genres.unique(), columns=['genres'])
genres_df.insert(0, 'genre_id', range(1, 1 + len(genres_df)))
genres_df

    genre_id          genres
0          1       animation
1          2          family
2          3           music
3          4         fantasy
4          5         fantasy
5          6         romance
6          7       animation
7          8        thriller
8          9           drama
9         10          comedy
10        11          family
11        12          action
12        13          horror
13        14          comedy
14        15          action
15        16   documentation
16        17        thriller
17        18   documentation
18        19         romance
19        20           scifi
20        21         western
21        22           music
22        23         western
23        24           scifi
24        25           sport
25        26        european
26        27           drama
27        28           crime
28        29
29        30         history
30        31         reality
31        32           crime
32        33          horror
33        34             war
34        35         history
35        36         reality
36        37             war
37        38           sport
38        39        european

In [28]:
# rename and upload the genres table into sql 
genres_df = genres_df.rename(columns={"genres":"genre_name"})
genres_df.to_sql(name='genres', con=engine, if_exists='append', index=False)

39

In [29]:
# add the genre_id back to the main data frame
genre_id_list = [genres_df.genre_id[genres_df.genre_name == i].values[0] for i in data.movie_genres]

data['genre_id'] = genre_id_list

data

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,...,company,person_id,name,character,role,range,length_id,type_id,movie_genres,genre_id
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"animation', 'family', 'music', 'fantasy",['US'],NaN,...,Disney,23433.0,Deems Taylor,Narrator - Narrative Introductions,ACTOR,long,1,1,animation,1
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"animation', 'family', 'music', 'fantasy",['US'],NaN,...,Disney,23433.0,Deems Taylor,Narrator - Narrative Introductions,ACTOR,long,1,1,family,2
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"animation', 'family', 'music', 'fantasy",['US'],NaN,...,Disney,23433.0,Deems Taylor,Narrator - Narrative Introductions,ACTOR,long,1,1,music,3
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"animation', 'family', 'music', 'fantasy",['US'],NaN,...,Disney,23433.0,Deems Taylor,Narrator - Narrative Introductions,ACTOR,long,1,1,fantasy,4
1,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,120,"animation', 'family', 'music', 'fantasy",['US'],NaN,...,Disney,5910.0,Walt Disney,Mickey Mouse (segment 'The Sorcerer's Apprenti...,ACTOR,long,2,1,animation,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
218429,tm1067128,Algo Azul,MOVIE,Romantic comedy...coming soon.,2021,NaN,90,comedy,['PA'],NaN,...,HBO,1245864.0,Ash Olivera,Nora,ACTOR,long,218430,1,comedy,14
218430,tm1067128,Algo Azul,MOVIE,Romantic comedy...coming soon.,2021,NaN,90,comedy,['PA'],NaN,...,HBO,2305203.0,Mariel Garcia Spooner,NaN,DIRECTOR,long,218431,1,comedy,14
218431,tm1121489,Entre Nos: What She Said,MOVIE,A stand-up comedy special featuring Shari Diaz...,2021,NaN,28,comedy,[],NaN,...,HBO,NaN,NaN,NaN,NaN,short,218432,1,comedy,14
218432,tm1121486,Entre Nos: The Winners 2,MOVIE,Comedy special starring winners of the second ...,2021,NaN,28,comedy,[],NaN,...,HBO,NaN,NaN,NaN,NaN,short,218433,1,comedy,14
218433,tm989132,The Infamous Future,MOVIE,The untold story of New York City's Eagle Acad...,2021,NaN,40,documentation,['US'],NaN,...,HBO,1742757.0,Richard Butterworth,NaN,DIRECTOR,short,218434,1,documentation,16

### insert into title_genre table

In [30]:
# insert title_genres into sql
title_genre_df = data[['id','genre_id']]

title_genre_df = title_genre_df.rename(columns={"id":"title_id"})

title_genre_df.to_sql(name='title_genres', con=engine, if_exists='append', index=False)

996

### insert into _age_certification_ table

In [31]:
data.age_certification = data.age_certification.fillna('NO CERTIFICATION')
age_certification_df = pd.DataFrame(data.age_certification.unique(),columns = ['age_certification'])
age_certification_df.insert(0,'age_certification_id',range(1,1 + len(age_certification_df)))
age_certification_df = age_certification_df.rename(columns={"age_certification_id" : "certification_id", "age_certification" : "certification_name"})
age_certification_df
# there is one age_certification that has empty value, for future purpose, here i set it to N/A

    certification_id certification_name
0                  1                  G
1                  2                 PG
2                  3   NO CERTIFICATION
3                  4               TV-G
4                  5              TV-PG
5                  6              TV-14
6                  7              PG-13
7                  8              TV-Y7
8                  9               TV-Y
9                 10              TV-MA
10                11                  R
11                12              NC-17

In [32]:
# insert into sql
age_certification_df.to_sql(name='age_certification', con=engine, if_exists='append', index=False)

12

In [33]:
# add back to main dataframe
age_id_list = [age_certification_df.certification_id[age_certification_df.certification_name == i].values[0] for i in data.age_certification]
data.insert(6, 'age_certification_id', age_id_list)
data

,id,title,type,description,release_year,age_certification,age_certification_id,runtime,genres,production_countries,...,company,person_id,name,character,role,range,length_id,type_id,movie_genres,genre_id
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,1,120,"animation', 'family', 'music', 'fantasy",['US'],...,Disney,23433.0,Deems Taylor,Narrator - Narrative Introductions,ACTOR,long,1,1,animation,1
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,1,120,"animation', 'family', 'music', 'fantasy",['US'],...,Disney,23433.0,Deems Taylor,Narrator - Narrative Introductions,ACTOR,long,1,1,family,2
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,1,120,"animation', 'family', 'music', 'fantasy",['US'],...,Disney,23433.0,Deems Taylor,Narrator - Narrative Introductions,ACTOR,long,1,1,music,3
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,1,120,"animation', 'family', 'music', 'fantasy",['US'],...,Disney,23433.0,Deems Taylor,Narrator - Narrative Introductions,ACTOR,long,1,1,fantasy,4
1,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,1,120,"animation', 'family', 'music', 'fantasy",['US'],...,Disney,5910.0,Walt Disney,Mickey Mouse (segment 'The Sorcerer's Apprenti...,ACTOR,long,2,1,animation,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
218429,tm1067128,Algo Azul,MOVIE,Romantic comedy...coming soon.,2021,NO CERTIFICATION,3,90,comedy,['PA'],...,HBO,1245864.0,Ash Olivera,Nora,ACTOR,long,218430,1,comedy,14
218430,tm1067128,Algo Azul,MOVIE,Romantic comedy...coming soon.,2021,NO CERTIFICATION,3,90,comedy,['PA'],...,HBO,2305203.0,Mariel Garcia Spooner,NaN,DIRECTOR,long,218431,1,comedy,14
218431,tm1121489,Entre Nos: What She Said,MOVIE,A stand-up comedy special featuring Shari Diaz...,2021,NO CERTIFICATION,3,28,comedy,[],...,HBO,NaN,NaN,NaN,NaN,short,218432,1,comedy,14
218432,tm1121486,Entre Nos: The Winners 2,MOVIE,Comedy special starring winners of the second ...,2021,NO CERTIFICATION,3,28,comedy,[],...,HBO,NaN,NaN,NaN,NaN,short,218433,1,comedy,14
218433,tm989132,The Infamous Future,MOVIE,The untold story of New York City's Eagle Acad...,2021,NO CERTIFICATION,3,40,documentation,['US'],...,HBO,1742757.0,Richard Butterworth,NaN,DIRECTOR,short,218434,1,documentation,16

### insert into _imdb_ & _tmdb_ table

In [34]:
IMDB_df = data[['id', 'imdb_id', 'imdb_score', 'imdb_votes']]
IMDB_df = IMDB_df.drop_duplicates(subset=['id', 'imdb_id', 'imdb_score', 'imdb_votes'])

IMDB_df = IMDB_df.rename(columns={"id" : "title_id"})
IMDB_df.dropna(subset=['imdb_id'], inplace=True)

IMDB_df

         title_id     imdb_id  imdb_score  imdb_votes
0         tm74391   tt0032455         7.7     94681.0
16        tm67803   tt0029583         7.6    195321.0
30        tm82546   tt0032910         7.5    141937.0
51        tm79357   tt0034492         7.3    140406.0
66        tm62671   tt0043067         6.9      8229.0
...           ...         ...         ...         ...
218396   ts272570  tt14055674         5.0        48.0
218418  tm1067128   tt9257620         5.9        50.0
218431  tm1121489  tt15532762         NaN         NaN
218432  tm1121486  tt15532736         NaN         NaN
218433   tm989132   tt9064760         NaN         NaN

[13265 rows x 4 columns]

In [35]:
TMDB_df = data[['id', 'tmdb_popularity', 'tmdb_score']]
TMDB_df = TMDB_df.drop_duplicates(subset=['id', 'tmdb_popularity', 'tmdb_score'])
TMDB_df = TMDB_df.rename(columns={"id" : "title_id"})
TMDB_df

         title_id  tmdb_popularity  tmdb_score
0         tm74391           57.751         7.4
16        tm67803          107.137         7.1
30        tm82546           71.160         7.1
51        tm79357           68.136         7.0
66        tm62671           10.698         6.5
...           ...              ...         ...
218405  tm1082718            8.425         8.1
218418  tm1067128            1.400         2.0
218431  tm1121489              NaN         NaN
218432  tm1121486              NaN         NaN
218433   tm989132            1.101         5.3

[14660 rows x 3 columns]

In [36]:
# insert into sql
IMDB_df.to_sql(name='imdb', con=engine, if_exists='append', index=False)
TMDB_df.to_sql(name='tmdb', con=engine, if_exists='append', index=False)

660

### Insert into _role_ table

In [37]:
data.role = data.role.fillna('NOT MENTIONED')
role_df = pd.DataFrame(data.role.unique(),columns = ['role'])
role_df.insert(0,'role_id',range(1,1 + len(role_df)))
role_df

   role_id           role
0        1          ACTOR
1        2       DIRECTOR
2        3  NOT MENTIONED

In [38]:
role_df.to_sql(name='role', con=engine, if_exists='append', index=False)

3

In [39]:
role_id_list = [role_df.role_id[role_df.role == i].values[0] for i in data.role]
data.insert(25, 'role_id', role_id_list)
data

,id,title,type,description,release_year,age_certification,age_certification_id,runtime,genres,production_countries,...,person_id,name,character,role,range,length_id,type_id,movie_genres,role_id,genre_id
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,1,120,"animation', 'family', 'music', 'fantasy",['US'],...,23433.0,Deems Taylor,Narrator - Narrative Introductions,ACTOR,long,1,1,animation,1,1
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,1,120,"animation', 'family', 'music', 'fantasy",['US'],...,23433.0,Deems Taylor,Narrator - Narrative Introductions,ACTOR,long,1,1,family,1,2
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,1,120,"animation', 'family', 'music', 'fantasy",['US'],...,23433.0,Deems Taylor,Narrator - Narrative Introductions,ACTOR,long,1,1,music,1,3
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,1,120,"animation', 'family', 'music', 'fantasy",['US'],...,23433.0,Deems Taylor,Narrator - Narrative Introductions,ACTOR,long,1,1,fantasy,1,4
1,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,1,120,"animation', 'family', 'music', 'fantasy",['US'],...,5910.0,Walt Disney,Mickey Mouse (segment 'The Sorcerer's Apprenti...,ACTOR,long,2,1,animation,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
218429,tm1067128,Algo Azul,MOVIE,Romantic comedy...coming soon.,2021,NO CERTIFICATION,3,90,comedy,['PA'],...,1245864.0,Ash Olivera,Nora,ACTOR,long,218430,1,comedy,1,14
218430,tm1067128,Algo Azul,MOVIE,Romantic comedy...coming soon.,2021,NO CERTIFICATION,3,90,comedy,['PA'],...,2305203.0,Mariel Garcia Spooner,NaN,DIRECTOR,long,218431,1,comedy,2,14
218431,tm1121489,Entre Nos: What She Said,MOVIE,A stand-up comedy special featuring Shari Diaz...,2021,NO CERTIFICATION,3,28,comedy,[],...,NaN,NaN,NaN,NOT MENTIONED,short,218432,1,comedy,3,14
218432,tm1121486,Entre Nos: The Winners 2,MOVIE,Comedy special starring winners of the second ...,2021,NO CERTIFICATION,3,28,comedy,[],...,NaN,NaN,NaN,NOT MENTIONED,short,218433,1,comedy,3,14
218433,tm989132,The Infamous Future,MOVIE,The untold story of New York City's Eagle Acad...,2021,NO CERTIFICATION,3,40,documentation,['US'],...,1742757.0,Richard Butterworth,NaN,DIRECTOR,short,218434,1,documentation,2,16

### Insert into _company_ table

In [40]:
data.company = data.company.fillna(0)
company_df = pd.DataFrame(data.company.unique(),columns = ['company_name'])
company_df.insert(0,'company_id',range(1,1 + len(company_df)))
company_df

   company_id company_name
0           1       Disney
1           2       Amazon
2           3          HBO

In [41]:
company_df.to_sql(name='company', con=engine, if_exists='append', index=False)

3

In [42]:
conditions_2 = [
    (data['company'] == 'Disney'),
    (data['company'] == 'Amazon'),
    (data['company'] == 'HBO')
]

values = [1, 2, 3]

data['company_id'] = np.select(conditions_2, values)

### insert into person table

In [43]:
person_df = data[['person_id','name']]
person_df = person_df.drop_duplicates(subset=['person_id','name'])
person_df

        person_id                   name
0         23433.0           Deems Taylor
1          5910.0            Walt Disney
2         23436.0         Julietta Novis
3         23434.0      Leopold Stokowski
4         23441.0       Paul Satterfield
...           ...                    ...
218425  2305720.0  Hugo Victor Rodriguez
218426  2305322.0   Juan Carlos Avendaño
218428  2305342.0        Fabiola Sánchez
218430  2305203.0  Mariel Garcia Spooner
218433  1742757.0    Richard Butterworth

[120101 rows x 2 columns]

In [51]:
person_df['person_id'].isnull().sum()

1

In [54]:
person_df['person_id'].max()

2371153.0

In [55]:
person_df['person_id'] = person_df['person_id'].fillna(2371154.0)

In [63]:
data['person_id'] = data['person_id'].fillna(2371154.0)

In [56]:
person_df['person_id'].isnull().sum()

0

In [60]:
person_df.to_sql(name='person', con=engine, if_exists='append', index=False)

101

### Insert into _character_detail_ table

In [67]:
Character_detail_df = data[['person_id','character', 'role_id']]

Character_detail_df = Character_detail_df.drop_duplicates(subset=['person_id','character', 'role_id'])

Character_detail_df.insert(0,'character_detail_id',range(1,1 + len(Character_detail_df)))

Character_detail_df

,character_detail_id,person_id,character,role_id
0,1,23433.0,Narrator - Narrative Introductions,1
1,2,5910.0,Mickey Mouse (segment 'The Sorcerer's Apprenti...,1
2,3,23436.0,Soloist (segment 'Ave Maria') (singing voice),1
3,4,23434.0,Himself - Conductor of The Philadelphia Orchestra,1
4,5,23441.0,NaN,2
...,...,...,...,...
218427,204939,1224011.0,Marta,1
218428,204940,2305342.0,Claudia,1
218429,204941,1245864.0,Nora,1
218430,204942,2305203.0,NaN,2
218433,204943,1742757.0,NaN,2

In [68]:
# create new columns in the dataframe and set to NaT
Character_detail_df['voice'] = np.where(Character_detail_df['character'].str.contains('voice'), 'YES', 'NO')
Character_detail_df['singing_voice'] = np.where(Character_detail_df['character'].str.contains('singing voice'), 'YES', 'NO')
Character_detail_df['credited'] = np.where(Character_detail_df['character'].str.contains('uncredited'), 'YES', 'NO')
Character_detail_df['credit_only'] = np.where(Character_detail_df['character'].str.contains('credit only'), 'YES', 'NO')

Character_detail_df

,character_detail_id,person_id,character,role_id,voice,singing_voice,credited,credit_only
0,1,23433.0,Narrator - Narrative Introductions,1,NO,NO,NO,NO
1,2,5910.0,Mickey Mouse (segment 'The Sorcerer's Apprenti...,1,YES,NO,NO,NO
2,3,23436.0,Soloist (segment 'Ave Maria') (singing voice),1,YES,YES,NO,NO
3,4,23434.0,Himself - Conductor of The Philadelphia Orchestra,1,NO,NO,NO,NO
4,5,23441.0,NaN,2,YES,YES,YES,YES
...,...,...,...,...,...,...,...,...
218427,204939,1224011.0,Marta,1,NO,NO,NO,NO
218428,204940,2305342.0,Claudia,1,NO,NO,NO,NO
218429,204941,1245864.0,Nora,1,NO,NO,NO,NO
218430,204942,2305203.0,NaN,2,YES,YES,YES,YES
218433,204943,1742757.0,NaN,2,YES,YES,YES,YES

In [69]:
Character_detail_df.character = Character_detail_df.character.fillna('NOT MENTIONED')

In [70]:
Character_detail_df

,character_detail_id,person_id,character,role_id,voice,singing_voice,credited,credit_only
0,1,23433.0,Narrator - Narrative Introductions,1,NO,NO,NO,NO
1,2,5910.0,Mickey Mouse (segment 'The Sorcerer's Apprenti...,1,YES,NO,NO,NO
2,3,23436.0,Soloist (segment 'Ave Maria') (singing voice),1,YES,YES,NO,NO
3,4,23434.0,Himself - Conductor of The Philadelphia Orchestra,1,NO,NO,NO,NO
4,5,23441.0,0,2,YES,YES,YES,YES
...,...,...,...,...,...,...,...,...
218427,204939,1224011.0,Marta,1,NO,NO,NO,NO
218428,204940,2305342.0,Claudia,1,NO,NO,NO,NO
218429,204941,1245864.0,Nora,1,NO,NO,NO,NO
218430,204942,2305203.0,0,2,YES,YES,YES,YES
218433,204943,1742757.0,0,2,YES,YES,YES,YES

In [71]:
Character_detail_df.to_sql(name='character_detail', con=engine, if_exists='append', index=False)

943

In [90]:
character_detail_id_list = [Character_detail_df.character_detail_id[Character_detail_df.person_id == i].values[0] for i in data.person_id]
data.insert(19, 'character_detail_id', character_detail_id_list)
data

,id,title,type,description,release_year,age_certification,age_certification_id,runtime,genres,production_countries,...,character_detail_id,character,role,range,length_id,type_id,movie_genres,role_id,genre_id,company_id
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,1,120,"animation', 'family', 'music', 'fantasy",['US'],...,1,Narrator - Narrative Introductions,ACTOR,long,1,1,animation,1,1,1
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,1,120,"animation', 'family', 'music', 'fantasy",['US'],...,1,Narrator - Narrative Introductions,ACTOR,long,1,1,family,1,2,1
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,1,120,"animation', 'family', 'music', 'fantasy",['US'],...,1,Narrator - Narrative Introductions,ACTOR,long,1,1,music,1,3,1
0,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,1,120,"animation', 'family', 'music', 'fantasy",['US'],...,1,Narrator - Narrative Introductions,ACTOR,long,1,1,fantasy,1,4,1
1,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1940,G,1,120,"animation', 'family', 'music', 'fantasy",['US'],...,2,Mickey Mouse (segment 'The Sorcerer's Apprenti...,ACTOR,long,2,1,animation,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
218429,tm1067128,Algo Azul,MOVIE,Romantic comedy...coming soon.,2021,NO CERTIFICATION,3,90,comedy,['PA'],...,118557,Nora,ACTOR,long,218430,1,comedy,1,14,3
218430,tm1067128,Algo Azul,MOVIE,Romantic comedy...coming soon.,2021,NO CERTIFICATION,3,90,comedy,['PA'],...,204942,NaN,DIRECTOR,long,218431,1,comedy,2,14,3
218431,tm1121489,Entre Nos: What She Said,MOVIE,A stand-up comedy special featuring Shari Diaz...,2021,NO CERTIFICATION,3,28,comedy,[],...,9825,NaN,NOT MENTIONED,short,218432,1,comedy,3,14,3
218432,tm1121486,Entre Nos: The Winners 2,MOVIE,Comedy special starring winners of the second ...,2021,NO CERTIFICATION,3,28,comedy,[],...,9825,NaN,NOT MENTIONED,short,218433,1,comedy,3,14,3
218433,tm989132,The Infamous Future,MOVIE,The untold story of New York City's Eagle Acad...,2021,NO CERTIFICATION,3,40,documentation,['US'],...,204943,NaN,DIRECTOR,short,218434,1,documentation,2,16,3

### insert into actor_detail table

In [94]:
import math
actor = data.loc[data['role'] == 'ACTOR']

actor_detail_df = actor[['id','person_id','character_detail_id']]
actor_detail_df = actor_detail_df.drop_duplicates(subset=['id','person_id','character_detail_id'])
actor_detail_df = actor_detail_df.rename(columns={"id": "title_id"})
actor_detail_df

         title_id  person_id  character_detail_id
0         tm74391    23433.0                    1
1         tm74391     5910.0                    2
2         tm74391    23436.0                    3
3         tm74391    23434.0                    4
16        tm67803     6134.0                   17
...           ...        ...                  ...
218425  tm1067128  2305720.0               204937
218426  tm1067128  2305322.0               204938
218427  tm1067128  1224011.0               134878
218428  tm1067128  2305342.0               204940
218429  tm1067128  1245864.0               118557

[203464 rows x 3 columns]

In [95]:
actor_detail_df.to_sql(name='actor_detail', con=engine, if_exists='append', index=False)

464

### insert into Director_detail table

In [96]:
director = data.loc[data['role'] == 'DIRECTOR']

director_detail_df = director[['id','person_id']]
director_detail_df = director_detail_df.drop_duplicates(subset=['id','person_id'])
director_detail_df = director_detail_df.rename(columns={"id": "title_id"})

director_detail_df

         title_id  person_id
4         tm74391    23441.0
5         tm74391    23442.0
6         tm74391    23443.0
7         tm74391     6164.0
8         tm74391    23444.0
...           ...        ...
218404   tm927169  1567817.0
218416  tm1082718   781112.0
218417  tm1082718  2012339.0
218430  tm1067128  2305203.0
218433   tm989132  1742757.0

[12485 rows x 2 columns]

In [97]:
director_detail_df.to_sql(name='director_detail', con=engine, if_exists='append', index=False)

485

### Insert into _country_ table

In [98]:
data['production_countries']=data['production_countries'].str.strip('[]')
data['production_countries']=data['production_countries'].replace('"','')


temp_country_df = data.production_countries.str.split(',').apply(pd.Series, 1).stack()
temp_country_df.index = temp_country_df.index.droplevel(-1)
temp_country_df.name = 'country_name'
data = data.join(temp_country_df)

# remove extra quotation marks in the string
for i in range(len(data.country_name)):
    data.country_name.values[i] = re.sub("'", "", data.country_name.values[i])

data.movie_genres

# insert id into country table
country_df= pd.DataFrame(data.country_name.unique(), columns=['country'])
country_df.insert(0, 'country_id', range(1, 1 + len(country_df)))
country_df

     country_id country
0             1      US
1             2      GB
2             3      US
3             4      CA
4             5
..          ...     ...
206         207      PK
207         208      PY
208         209      SY
209         210      MY
210         211      NG

[211 rows x 2 columns]

In [99]:
# insert country_df into sql
country_df.to_sql(name='country', con=engine, if_exists='append', index=False)

211

In [100]:
country_df.country = country_df.country.fillna(0)

# add country_id to main dataframe
country_id_list = [country_df.country_id[country_df.country == i].values[0] for i in data.country_name]
data['country_id'] = country_id_list

In [101]:
del data['production_countries']

### Insert into _description_ table

In [102]:
data.description = data.description.fillna(0)
description_df = data[['id', 'type_id', 'description', 'release_year', 'length_id', 'seasons', 'company_id', 'country_id', 'age_certification_id']]
description_df.insert(0, 'description_id', range(1, 1 + len(description_df)))
description_df = description_df.rename(columns={"id" : "title_id"})
description_df

,description_id,title_id,type_id,description,release_year,length_id,seasons,company_id,country_id,age_certification_id
0,1,tm74391,1,Walt Disney's timeless masterpiece is an extra...,1940,1,NaN,1,1,1
0,2,tm74391,1,Walt Disney's timeless masterpiece is an extra...,1940,1,NaN,1,1,1
0,3,tm74391,1,Walt Disney's timeless masterpiece is an extra...,1940,1,NaN,1,1,1
0,4,tm74391,1,Walt Disney's timeless masterpiece is an extra...,1940,1,NaN,1,1,1
0,5,tm74391,1,Walt Disney's timeless masterpiece is an extra...,1940,1,NaN,1,1,1
...,...,...,...,...,...,...,...,...,...,...
218429,2614170,tm1067128,1,Romantic comedy...coming soon.,2021,218430,NaN,3,166,3
218430,2614171,tm1067128,1,Romantic comedy...coming soon.,2021,218431,NaN,3,166,3
218431,2614172,tm1121489,1,A stand-up comedy special featuring Shari Diaz...,2021,218432,NaN,3,5,3
218432,2614173,tm1121486,1,Comedy special starring winners of the second ...,2021,218433,NaN,3,5,3
218433,2614174,tm989132,1,The untold story of New York City's Eagle Acad...,2021,218434,NaN,3,1,3

In [103]:
description_df.to_sql(name='description', con=engine, if_exists='append', index=False)

174

In [104]:
data['description_id'] = description_df.description_id

### What's the average IMDB score for the top 10 ‘animation’ movies (sorted by imdb votes) produced in the US?

In [18]:
q1 = """
select avg(imdb_score) as average_score from (
    SELECT imdb_score
    from IMDB
    left join title_genres on IMDB.title_id = title_genres.title_id
    left join genres on title_genres.genre_id = genres.genre_id
    left join description on title_genres.title_id = description.title_id
    where genre_name = 'animation' and country_id = '1' and imdb_score is not null
    order by imdb_score desc
    limit 10) t
"""
connection.execute(q1)

### What’s the “drama” movie that were only produced in the last three years(from 2018-2021) in each of companies

In [9]:
q2 = """
select * from (
    select DISTINCT title_name, company_name
    from company
    left join description on description.company_id = company.company_id
    left join title on title.title_id = description.title_id
    left join title_genres on title_genres.title_id = description.title_id
    left join genres on title_genres.genre_id = genres.genre_id
    where genre_name = 'drama' and release_year > 2017) t
group by company_name, title_name
"""
connection.execute(q2)

### Which year has the highest number of movies produced?

In [10]:
q3 = """
select count(title_id) as amount_of_movie_produced, release_year
from description
group by release_year
order by amount_of_movie_produced desc
limit 1
"""
connection.execute(q3)

### What’s the top 3 genres that received the highest number of IMDB votes?

In [14]:
q4 = """
SELECT DISTINCT genre_name, sum(imdb_votes) as total_votes
from IMDB
left join title_genres
on IMDB.title_id = title_genres.title_id
left join genres
on title_genres.genre_id = genres.genre_id
left join description
on title_genres.title_id = description.title_id
group by genre_name
order by total_votes desc
limit 3;
"""
connection.execute(q4)

### What’s top 3 most popular genres in Great Britain?

In [16]:
q5 = """
SELECT DISTINCT genre_name, count(title_genres.title_id) as amount_movie_produced_in_each_genre
from description
left join country
on description.country_id = country.country_id
left join title_genres
on title_genres.title_id = description.title_id
left join genres
on title_genres.genre_id = genres.genre_id
WHERE country = 'GB'
group by genre_name
order by amount_movie_produced_in_each_genre desc
limit 3;
"""
connection.execute(q5)

### Which company produced the most amount of movies during the 2020 pandemic season?

In [17]:
q6 = """
SELECT DISTINCT company_name, count(title_genres.title_id) as total_amount_movie_produced
from description
left join company
on description.company_id = company.company_id
left join title_genres
on title_genres.title_id = description.title_id
WHERE release_year = 2020
group by company_name
order by total_amount_movie_produced desc
limit 1
"""
connection.execute(q6)

### Which director also performed in their movies?

In [4]:
q7 = """
SELECT name
FROM (SELECT DISTINCT name
      FROM person
      INNER JOIN actor_detail on person.person_id=actor_detail.person_id
      INNER JOIN director_detail on actor_detail.person_id=director_detail.person_id)t
GROUP BY name
"""
connection.execute(q7)

### Which top 10 directors have produced the most productions among all companies

In [5]:
q8 = """
SELECT COUNT(title) AS total_production,name,company_name
FROM (SELECT DISTINCT title,name,company_name
      FROM person
      INNER JOIN director_detail on person.person_id=director_detail.person_id
      INNER JOIN title on title.title_id=director_detail.title_id
      INNER JOIN description on title.title_id=description.title_id
      INNER JOIN company on company.company_id=description.company_id)t
GROUP BY name,company_name
ORDER BY total_production DESC
LIMIT 10;
"""
connection.execute(q8)

### Which genre has the most amount of actors?

In [6]:
q9 = """
SELECT COUNT(title_id) AS total_genre,genre_name
FROM (SELECT DISTINCT genre_name, title_genres.title_id
      FROM genres
      INNER JOIN title_genres on genres.genre_id=title_genres.genre_id
      INNER JOIN actor_detail on title_genres.title_id=actor_detail.title_id)t
GROUP BY genre_name
ORDER BY total_genre DESC
LIMIT 1;
"""
connection.execute(q9)

### Which actors comes from China in 2020 production?

In [7]:
q10 = """
SELECT name,country,release_year
FROM (SELECT DISTINCT name,country,release_year
      FROM person
      INNER JOIN actor_detail on person.person_id=actor_detail.person_id
      INNER JOIN description on actor_detail.title_id=description.title_id
      INNER JOIN country on description.country_id=country.country_id)t
WHERE country='CN' AND release_year=2020
"""
connection.execute(q10)